README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<!-- 2017-11-25 Sat 01:50 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="merlin" />
</head>
<body>
<div id="content">
<h1 class="title">README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Emacs Class by Merlin Corey</a>
<ul>
<li><a href="#sec-1-1">1.1. History</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Presentation</a>
<ul>
<li><a href="#sec-2-1">2.1. References</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. How to present using Org-mode in Emacs&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2013">2013</span>&#xa0;<span class="sacha">sacha</span>&#xa0;<span class="chua">chua</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="how">how</span>&#xa0;<span class="to">to</span>&#xa0;<span class="presentation">presentation</span>&#xa0;<span class="slides">slides</span></span></a></li>
<li><a href="#sec-2-1-2">2.1.2. org-present-mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2014">2014</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="org">org</span>&#xa0;<span class="present">present</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="presentation">presentation</span>&#xa0;<span class="slides">slides</span></span></a></li>
<li><a href="#sec-2-1-3">2.1.3. EmacsWiki :: EmacsPresentation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2015">2015</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="wiki">wiki</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="presentation">presentation</span>&#xa0;<span class="slides">slides</span></span></a></li>
<li><a href="#sec-2-1-4">2.1.4. Bestowed - Extremely simple presentation (ppt, keynote, etc) framework for org-mode export</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">3. intro-slides.org (intro-slides.html)</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Emacs Class by Merlin Corey</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs class notes, scripts, and examples.
</p>

<p>
Example configuration tree in <a href="./dotemacs/">./dotemacs/</a> installable with <code>sh installer.sh</code> (<a href="./dotemacs/installer.sh">installer.sh</a>).
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> History</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Merlin has given this class a couple of times at Null Space Labs.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Class</th>
<th scope="col" class="left">Location</th>
<th scope="col" class="left">Date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><a href="https://www.meetup.com/NullSpaceLabs/events/230325844/">Intro to Emacs</a></td>
<td class="left">Null Space Labs 2.0</td>
<td class="left">2016 May 14</td>
</tr>

<tr>
<td class="left"><a href="https://www.meetup.com/NullSpaceLabs/events/244979379/">Introduction to Emacs</a></td>
<td class="left">Null Space Labs 3.0</td>
<td class="left">2017 November 25</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Presentation</h2>
<div class="outline-text-2" id="text-2">
<p>
Emacs is used for presentation with <code>org-present-mode</code>.
</p>

<p>
Org files are exported to HTML as well and thus readable <a href="http://merlincorey.github.io/emacs-class/README.html">on merlincorey.github.io</a>.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> References</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> <a href="http://sachachua.com/blog/2013/04/how-to-present-using-org-mode-in-emacs/">How to present using Org-mode in Emacs</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2013">2013</span>&#xa0;<span class="sacha">sacha</span>&#xa0;<span class="chua">chua</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="how">how</span>&#xa0;<span class="to">to</span>&#xa0;<span class="presentation">presentation</span>&#xa0;<span class="slides">slides</span></span></h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Some good notes on Emacs presentations from a well known emacs user who <a href="https://gist.github.com/sachac/5278905">presented with org-mode at EmacsConf 2013</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> <a href="https://github.com/rlister/org-present">org-present-mode</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2014">2014</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="org">org</span>&#xa0;<span class="present">present</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="presentation">presentation</span>&#xa0;<span class="slides">slides</span></span></h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
This is the presentation mode that Merlin used for at least the first two classes.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> <a href="https://www.emacswiki.org/emacs/EmacsPresentation">EmacsWiki :: EmacsPresentation</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="2015">2015</span>&#xa0;<span class="emacs">emacs</span>&#xa0;<span class="wiki">wiki</span>&#xa0;<span class="org">org</span>&#xa0;<span class="mode">mode</span>&#xa0;<span class="presentation">presentation</span>&#xa0;<span class="slides">slides</span></span></h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
A collection of stories about using Emacs for presentation with various modes.
</p>

<p>
Merlin uses <code>org-present-mode</code> but has played with <code>org-presie</code> as well.
</p>
</div>
</div>

<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> <a href="https://github.com/robrohan/bestowed">Bestowed - Extremely simple presentation (ppt, keynote, etc) framework for org-mode export</a></h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
Framework to add theming and javascript presentation to org-mode HTML export.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="./intro-slides.html">intro-slides.org</a> <a href="./intro-slides.html">(intro-slides.html)</a></h2>
<div class="outline-text-2" id="text-3">
<p>
The Introduction to Emacs class slides.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: merlin</p>
<p class="date">Created: 2017-11-25 Sat 01:50</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
